from aiogram.types import ReplyKeyboardMarkup, KeyboardButton

# Уровни игроков с описаниями и рейтинговыми очками
player_levels = {
    "0.0": {"desc": "Новичок без опыта", "points": 0},
    "0.5": {"desc": "Делает первые шаги", "points": 300},
    "1.0": {"desc": "Теннисист делает первые шаги", "points": 500},
    "1.5": {"desc": "Игрок обладает небольшим опытом, совершенствует стабильность ударов", "points": 700},
    "2.0": {"desc": "Заметны недостатки при выполнении основных ударов. Укороченный замах", "points": 900},
    "2.5": {"desc": "Пытается предвидеть направление полета мяча, но чувство корта слабое", "points": 1100},
    "3.0": {"desc": "Хорошо отбивает средние по темпу мячи, но не всегда контролирует силу", "points": 1200},
    "3.5": {"desc": "Может контролировать направление ударов средней сложности", "points": 1400},
    "4.0": {"desc": "Выполняет разнообразные удары, контролирует глубину и направление", "points": 1600},
    "4.5": {"desc": "Разнообразные удары, эффективно использует силу и вращение", "points": 1800},
    "5.0": {"desc": "Прекрасно чувствует мяч, выполняет особенные удары", "points": 2000},
    "5.5": {"desc": "Главное оружие - мощные удары и стабильность", "points": 2200},
    "6.0": {"desc": "Высокая квалификация", "points": 2400},
    "6.5": {"desc": "Близок к профессиональному уровню", "points": 2600},
    "7.0": {"desc": "Спортсмен мирового класса", "points": 2800}
}

moscow_districts = [
    "Москва - ВАО", "Москва - ЗАО", "Москва - ЗелАО",
    "Москва - САО", "Москва - СВАО", "Москва - СЗАО",
    "Москва - ЦАО", "Москва - ЮАО", "Москва - ЮВАО", "Москва - ЮЗАО"
]

# Округа Москвы
game_types = ["Одиночная", "Парная", "Микст", "Тренировка"]
payment_types = ["💰 Пополам", "💳 Я оплачиваю", "💵 Соперник оплачивает", "🎾 Проигравший оплачивает"]
roles = ["🎯 Игрок", "👨‍🏫 Тренер", "🏆 Организатор"]

PRICE_RANGES = [
    {"min": 0, "max": 1000, "label": "до 1000 руб."},
    {"min": 1000, "max": 2000, "label": "1000-2000 руб."},
    {"min": 2000, "max": 3000, "label": "2000-3000 руб."},
    {"min": 3000, "max": 5000, "label": "3000-5000 руб."},
    {"min": 5000, "max": 10000, "label": "5000-10000 руб."},
    {"min": 10000, "max": float('inf'), "label": "от 10000 руб."}
]

base_keyboard = ReplyKeyboardMarkup(
    keyboard=[
        [
            KeyboardButton(text="🎾 Поиск партнера"),
            KeyboardButton(text="⏱ Предложение игр"),
        ],
        [
            KeyboardButton(text="📝 Внести счет"),
            KeyboardButton(text="💳 Платежи"),
        ],
        [
            KeyboardButton(text="🔍 Еще"),
        ]
    ],
    resize_keyboard=True,
    one_time_keyboard=False
)

GENDER_TYPES=["Мужской", "Женский"]
PLAYER_LEVELS=["0.0", "0.5", "2.0", "2.5", "3.0", "4.5", "5.0", "5.5", "6.0", "6.5", "7.0"]