# Типы турниров
TOURNAMENT_TYPES = ["Олимпийская система", "Круговая"]

# Пол участников
GENDERS = ["Мужчины", "Женщины"]

# Категории турниров
CATEGORIES = [
    "1 категория", "2 категория", "Мастер", "Мужская пара", "Женская пара", "Микст"
]

# Возрастные группы
AGE_GROUPS = ["Взрослые 18+", "Дети до 18"]

# Продолжительность турниров
DURATIONS = ["Многодневные", "Однодневные", "Выездной"]

# Опции Да/Нет
YES_NO_OPTIONS = ["Да", "Нет"]

# Районы Москвы
DISTRICTS_MOSCOW = ["Север", "Юг"]

# Минимальное количество участников для разных типов турниров
MIN_PARTICIPANTS = {
    "Олимпийская система": 4,  # Минимум 4 участника для олимпийской системы
    "Круговая": 3  # Минимум 3 участника для круговой системы
}
